yes = "✅"
no = "❌"
yes_letter = "Да"
no_letter = "Нет"
choose_from_button = "Выберите одну из кнопок"
digit = "Пожалуйста введите цифрами"
the_number_of_members_is_limited = "Количество участников ограничено"
something_went_wrong = "Что-то пошло не так: "
no_such_members = "Нет участинков"


# authorization.py
user_language = "🇷🇺Для начала выберите удобный вам язык!\n" \
                "🇺🇿Ўзингизга қулай тилни танланг!\n"
user_name = "Введите ФИО"
user_phone = "Отправьте контакт"
contact = "Ваш контакт"
confirm_number = "Подтвердите свой номер с смс"
accept_registration = "Вы успешно зарегестрированы"
refuse_registration = "Вы отклонили пользовательское соглашение поэтому мы не сможем продолжить.\n" \
                      "" \
                      "Нажмите /start если хотите заново зарегестрироваться"
wrong_sms = "Вы ввели не тот смс, попробуйте еще раз"
right_sms = "Вы ввели правильно смс"
subscribe_time_is_up = "Ваше время истекло, теперь приобретите подписку"
confirm_the_user_agreement = "Теперь вам нужно подтвердить пользовательское соглашение"
enter_token_to_join = "Введите токен для присоеденения"

# create_group.py and join_group.py
create_back = "⬅️Назад"
create_group = "Создать круг"
send_name = "Дайте имя кругу"
send_money = "Выберите сумму"
input_money = "Введите сумму:"
send_location = "Отправьте локацию"
send_link = "Отправьте линк группы"
send_start = "Отправьте дату начала"
invalid_date_format = "Невереная дата"
send_period = "Выберите переодичность"
send_private = "Выберите приватность"
send_members = "Введите количество участников"
check_info = "Вы успешно создали гап\nПодтверждаете информацию если да то нажмите на галочку если нет то на крестик и вас перекинет к началу создания группы"
your_token = "Вот ваш токен для приглашения "
start = "Старт"
my_group = "Мои круги"
choose_group = "Выбор круга"
complain = "Пожаловаться"
settings = "Настройки"
info = "Общая информация"
list_members = "Список участников"
privates = "Закрытый"
public = "Открытый"
other_money = "Другая сумма"
you_success_started_group = "Вы успешно начали гап "
creater_group = "Создатель гапа "
started = "стартовал"
"Не получилось изменить"
"Успешно изменено"


you_are_logged_in = "Вы вошли в круг"
join_group = "Присоедениться"
join_back = "⬅️ Назад"
no_such_group = "Нет такого круга"
you_had_only_one_group = "У вас только 1 группа"
your_complaint_has_been_accepted = "Ваша жалоба принята"
members_of_your_group = "Участники вашей группы"
you_have_confirmed_the_payment = "Вы подтвердили платеж"
you_canceled_a_payment = "Вы отменили платеж"
did_he_make_the_payment = "Сделал ли он платеж?"
wants_to_change_his_turn = "хочет поменяться его очередь "
your_request_has_gone_waiting_for_a_response = "Ваш запрос ушел, ждем ответа"



# subscribe.py
subscribe = "ПОДПИСКА"

# callback.py
you_have_successfully_switched_now_its_your_turn = "Вы успешно поменялись, теперь ваша очередь "
you_click_to_button_no = "Вы нажали кнопку 'Нет'"
you_denied = "Вам отказали"


# menu.py
main_menu = "Главное меню"
onse_week = "Раз в неделю"
onse_month = "Раз в в месяц"
close = "Закрытый"
open = "Открытый"


# settings
change_name = "Изменить имя"
change_date = "Изменить дату встречи"
change_period = "Изменить переодичность"
change_link = "Изменить линк"
change_location = "Изменить локацию"
change_language = "Изменить язык"
