yes = "✅"
no = "❌"
choose_from_button = "Выберите одну из кнопок"
digit = "Пожалуйста введите цифрами"

# authorization.py
user_language = "🇷🇺Для начала выберите удобный вам язык!\n" \
                "🇺🇿Ўзингизга қулай тилни танланг!\n"
user_name = "Введите ФИО"
user_phone = "Отправьте контакт"
contact = "Ваш контакт"
confirm_number = "Подтвердите свой номер с смс"
accept_registration = "Вы успешно зарегестрированы"
refuse_registration = "Вы отклонили пользовательское соглашение поэтому мы не сможем продолжить.\n" \
                      "" \
                      "Нажмите /start если хотите заново зарегестрироваться"
wrong_sms = "Вы ввели не тот смс, попробуйте еще раз"
right_sms = "Вы ввели правильно смс"

# create_group.py
create_back = "⬅️Назад"
create_group = "Создать круг"
send_name = "Дайте имя кругу"
send_money = "Выберите сумму"
send_location = "Отправьте локацию"
send_link = "Отправьте линк группы"
send_start = "Отправьте дату начала"
invalid_date_format = "Невереная дата"
send_period = "Выберите переодичность"
send_private = "Выберите приватность"
send_members = "Введите количество участников"
check_info = "Вы успешно создали гап\nПодтверждаете информацию если да то нажмите на галочку если нет то на крестик и вас перекинет к началу создания группы"
your_token = "Вот ваш токен для приглашения "
start = "Старт"
my_group = "Мои круги"
choose_group = "Выбор круга"
complain = "Пожаловаться"
settings = "Настройки"
info = "Общая информация"
list_members = "Список участников"
privates = "Закрытый"
public = "Открытый"
other_money = "Другая сумма"

# join_group.py
join_group = "Присоедениться"
join_back = "⬅️ Назад"







# menu.py
main_menu = "Главное меню"
onse_week = "Раз в неделю"
onse_month = "Раз в в месяц"
close = "Закрытый"
open = "Открытый"


# settings
change_name = "Изменить имя"
change_date = "Изменить дату встречи"
change_period = "Изменить переодичность"
change_link = "Изменить линк"
change_location = "Изменить локацию"
